* COMMENT Default mouse bindings
#+BEGIN_SRC elisp :exports both
  (pp (sort (cl-reduce (lambda (acc binding)
                         (if (and
                              (consp binding)
                              (symbolp (car binding))
                              (string-match ".*mouse.*" (symbol-name (car binding))))
                             (cons binding acc)
                           acc))
                       (current-global-map)
                       :initial-value nil)
            (lambda (a b)
              (string-lessp (symbol-name (car a))
                            (symbol-name (car b))))))
#+END_SRC

#+RESULTS:
#+begin_example
((C-down-mouse-1 . mouse-buffer-menu)
 (C-down-mouse-2 . facemenu-menu)
 (C-down-mouse-3 menu-item "Menu Bar" ignore :filter
                 (lambda
                   (_)
                   (if
                       (zerop
                        (or
                         (frame-parameter nil 'menu-bar-lines)
                         0))
                       (mouse-menu-bar-map)
                     (mouse-menu-major-mode-map))))
 (C-mouse-4 . mwheel-scroll)
 (C-mouse-5 . mwheel-scroll)
 (C-mouse-6 lambda nil
            (interactive)
            (setq truncate-lines nil))
 (C-mouse-7 lambda nil
            (interactive)
            (setq truncate-lines t))
 (M-down-mouse-1 . mouse-drag-secondary)
 (M-drag-mouse-1 . mouse-set-secondary)
 (M-mouse-1 . mouse-start-secondary)
 (M-mouse-2 . mouse-yank-secondary)
 (M-mouse-3 . mouse-secondary-save-then-kill)
 (S-down-mouse-1 . mouse-appearance-menu)
 (S-mouse-3 . kmacro-end-call-mouse)
 (S-mouse-4 . mwheel-scroll)
 (S-mouse-5 . mwheel-scroll)
 (double-mouse-1 . mouse-set-point)
 (down-mouse-1 . mouse-drag-region)
 (drag-mouse-1 . mouse-set-region)
 (mouse-1 . mouse-set-point)
 (mouse-2 . mouse-yank-primary)
 (mouse-3 . mouse-save-then-kill)
 (mouse-4 lambda nil
          (interactive)
          (scroll-down 1))
 (mouse-5 lambda nil
          (interactive)
          (scroll-up 1))
 (mouse-6 lambda nil
          (interactive)
          (when truncate-lines
            (scroll-right 1 t)))
 (mouse-7 lambda nil
          (interactive)
          (when truncate-lines
            (scroll-left 1 t)))
 (mouse-movement . ignore)
 (triple-mouse-1 . mouse-set-point))
#+end_example

